<template>
  <main id="content" class="d-flex justify-content-center mt-3 flex-row">
    <div class="w-75">
      <img
        src="../55.avif"
        style="width: 100%; height: 350px; margin-top: 100px"
        alt=""
      />

      <div class="text-start mt-3">
        <p>{{ item.title }}</p>
        <h1>عنوان مقاله</h1>
        <p class="mt-3">
          حریم خصوصی در اینترنت دربرگیرنده حریم خصوصی کاربران اینترنت در مورد
          ذخیره اطلاعات و استفاده شخصی آنها، ارائه به شخص ثالث یا نمایش در فضای
          اینترنت است. این حق علاوه بر اطلاعات مربوط به شخص، ناظر بر فضا یعنی
          مکانی که فرد با آن مرتبط است نیز می‌شود.[۱] ز می‌شود.[۱] حریم خصوصی
          افراد در فضای مجازی به دو حوزه ارتباطات خصوصی یا غیرعمومی به اشکال
          مختلف و پایگاه‌های داده‌ای که حاوی اطلاعات شخصی افرادند تقسیم
          می‌شود.[۲] در سال ۲۰۱۳ سازمان ملل متحد قطعنامه‌ای با عنوان حق حریم
          شخصی صادر کرد و در آن از حقوق شهروندان کشورها در برابر جاسوسی دولت‌ها
          از فعالیت‌های از می‌شود.[۱] حریم خصوصی افراد در فضای مجازی به دو حوزه
          ارتباطات خصوصی یا غیرعمومی به اشکال مختلف و پایگاه‌های داده‌ای که حاوی
          اطلاعات شخصی افرادند تقسیم می‌شود.[۲] در سال ۲۰۱۳ سازمان ملل متحد
          قطعنامه‌ای با عنوان حق حریم شخصی صادر کرد و در آن از حقوق شهروندان
          کشورها در برابر جاسوسی دولت‌ها از فعالیت‌های از می‌شود.[۱] حریم خصوصی
          افراد در فضای مجازی به دو حوزه ارتباطات خصوصی یا غیرعمومی به اشکال
          مختلف و پایگاه‌های داده‌ای که حاوی اطلاعات شخصی افرادند تقسیم
          می‌شود.[۲] در سال ۲۰۱۳ سازمان ملل متحد قطعنامه‌ای با عنوان حق حریم
          شخصی صادر کرد و در آن از حقوق شهروندان کشورها در برابر جاسوسی دولت‌ها
          از فعالیت‌های ا ز می‌شود.[۱] حریم خصوصی افراد در فضای مجازی به دو حوزه
          ارتباطات خصوصی یا غیرعمومی به اشکال مختلف و پایگاه‌های داده‌ای که حاوی
          اطلاعات شخصی افرادند تقسیم می‌شود.[۲] در سال ۲۰۱۳ سازمان ملل متحد
          قطعنامه‌ای با عنوان حق حریم شخصی صادر کرد و در آن از حقوق شهروندان
          کشورها در برابر جاسوسی دولت‌ها از فعالیت‌های احریم خصوصی افراد در فضای
          مجازی به دو حوزه ارتباطات خصوصی یا غیرعمومی به اشکال مختلف و
          پایگاه‌های داده‌ای که حاوی اطلاعات شخصی افرادند تقسیم می‌شود.[۲] در
          سال ۲۰۱۳ سازمان ملل متحد قطعنامه‌ای با عنوان حق حریم شخصی صادر کرد و
          در آن از حقوق شهروندان کشورها در برابر جاسوسی دولت‌ها از فعالیت‌های
          اینترنتی دفاع کرد.[۳]
        </p>
      </div>
    </div>
  </main>
</template>


<script setup>
const route = useRoute();
import content from "../data/popularPosts.json";
const item = content.find((content) => content.id === route.params.id);
</script>